{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 16, 15], "dtype": "float32", "name": "input_8"}, "inbound_nodes": [], "name": "input_8", "class_name": "InputLayer"}, {"config": {"layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": true, "use_bias": true, "dropout": 0.0, "implementation": 1, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "name": "lstm_13", "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "units": 20}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_28", "trainable": true}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "bidirectional_28", "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "use_bias": true, "dropout": 0.0, "implementation": 1, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "name": "lstm_14", "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "units": 20}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_29", "trainable": true}, "inbound_nodes": [[["bidirectional_28", 0, 0, {}]]], "name": "bidirectional_29", "class_name": "Bidirectional"}, {"config": {"n": 4, "name": "repeat_vector_8", "trainable": true}, "inbound_nodes": [[["bidirectional_29", 0, 0, {}]]], "name": "repeat_vector_8", "class_name": "RepeatVector"}, {"config": {"layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": true, "use_bias": true, "dropout": 0.0, "implementation": 1, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_state": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "kernel_regularizer": null, "name": "lstm_15", "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "units": 20}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_30", "trainable": true}, "inbound_nodes": [[["repeat_vector_8", 0, 0, {}]]], "name": "bidirectional_30", "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "name": "dense_8", "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "units": 15, "bias_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_8", "trainable": true}, "inbound_nodes": [[["bidirectional_30", 0, 0, {}]]], "name": "time_distributed_8", "class_name": "TimeDistributed"}], "name": "LSTM_2-layers-20-units-encoder_1-layers-20-units-decoder- cpu", "output_layers": [["time_distributed_8", 0, 0]], "input_layers": [["input_8", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}